tap "coursier/formulas"
tap "gromgit/fuse"
tap "homebrew/command-not-found", "https://mirrors.tuna.tsinghua.edu.cn/git/homebrew/homebrew-command-not-found.git"
brew "autojump"
brew "bind"
brew "cheat"
brew "cloc"
brew "doggo"
brew "dos2unix"
brew "dust"
brew "ffmpeg"
brew "fish"
brew "gdb"
brew "git-delta"
brew "git-lfs"
brew "go"
brew "gping"
brew "groovy"
brew "httpie"
brew "hugo"
brew "iproute2mac"
brew "jo"
brew "jq"
brew "kew"
brew "lazygit"
brew "lux"
brew "mcfly"
brew "mpv"
brew "nvm"
brew "pidof"
brew "procs"
brew "python-tk@3.13"
brew "telnet"
brew "tldr"
brew "tlrc", link: false
brew "tofrodos"
brew "uv"
brew "wget"
brew "yazi"
brew "zola"
brew "zsh-autocomplete"
brew "zsh-autosuggestions"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"
brew "gromgit/fuse/ntfs-3g-mac"
cask "dbeaver-community"
cask "deskpad"
cask "google-chrome"
cask "iina"
cask "macfuse"
cask "markedit"
cask "miaoyan"
cask "mos"
cask "motrix"
cask "mounty"
cask "orbstack"
cask "pearcleaner"
cask "picgo"
cask "snipaste"
cask "squirrel"
cask "stretchly"
cask "tidgi"
cask "zed"
vscode "automatalabs.copilot-mcp"
vscode "colourafredi.vscode-deepseek"
vscode "docker.docker"
vscode "donjayamanne.githistory"
vscode "feiskyer.chatgpt-copilot"
vscode "formulahendry.code-runner"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "hediet.vscode-drawio"
vscode "kaiyi.qwerty-learner"
vscode "kirigaya.openmcp"
vscode "leetcode.vscode-leetcode"
vscode "mhutchie.git-graph"
vscode "moonbit.moonbit-lang"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.hexeditor"
vscode "ms-vscode.remote-explorer"
vscode "redhat.java"
vscode "rust-lang.rust-analyzer"
vscode "twxs.cmake"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-maven"
vscode "yzane.markdown-pdf"
vscode "yzhang.markdown-all-in-one"
