tap "antoniorodr/memo"
tap "coursier/formulas"
tap "gromgit/fuse"
tap "homebrew/command-not-found"
tap "steipete/tap"
tap "tw93/tap"
brew "autojump"
brew "bat"
brew "gettext"
brew "bind"
brew "glib"
brew "chafa"
brew "cheat"
brew "cloc"
brew "doggo"
brew "dos2unix"
brew "dust"
brew "faad2"
brew "libogg"
brew "libvorbis"
brew "opus"
brew "ffmpeg"
brew "gcc"
brew "fftw"
brew "fish"
brew "fisher"
brew "gdb"
brew "gh"
brew "git-delta"
brew "git-lfs"
brew "go"
brew "gping"
brew "groovy"
brew "httpie"
brew "hugo"
brew "hyperfine"
brew "iproute2mac"
brew "jenv"
brew "jo"
brew "jq"
brew "opusfile"
brew "taglib"
brew "kew"
brew "lazygit"
brew "lsusb"
brew "lux"
brew "make"
brew "mcfly"
brew "mpv"
brew "node"
brew "nvm"
brew "pidof"
brew "pipx"
brew "pkgconf"
brew "procs"
brew "prometheus"
brew "python-tk@3.13"
brew "telnet"
brew "tldr", link: false
brew "tlrc"
brew "tofrodos"
brew "tree"
brew "ttyd"
brew "uv"
brew "wget"
brew "yazi"
brew "you-get"
brew "zola"
brew "zsh-autocomplete"
brew "zsh-autosuggestions"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"
brew "antoniorodr/memo/memo"
brew "gromgit/fuse/ntfs-3g-mac"
brew "steipete/tap/gifgrep"
brew "tw93/tap/mole"
cask "1password-cli"
cask "dbeaver-community"
cask "deskpad"
cask "google-chrome"
cask "iina"
cask "macfuse"
cask "markedit"
cask "miaoyan"
cask "mos"
cask "motrix"
cask "mounty"
cask "navicat-premium-lite"
cask "oracle-jdk@21"
cask "orbstack"
cask "pearcleaner"
cask "picgo"
cask "snipaste"
cask "squirrel-app"
cask "stretchly"
cask "tidgi"
cask "zed"
vscode "automatalabs.copilot-mcp"
vscode "donjayamanne.githistory"
vscode "formulahendry.code-runner"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "hediet.vscode-drawio"
vscode "kaiyi.qwerty-learner"
vscode "kirigaya.openmcp"
vscode "leetcode.vscode-leetcode"
vscode "mhutchie.git-graph"
vscode "moonbit.moonbit-lang"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.cpp-devtools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.hexeditor"
vscode "ms-vscode.remote-explorer"
vscode "ppz.ppz"
vscode "redhat.java"
vscode "rust-lang.rust-analyzer"
vscode "saoudrizwan.claude-dev"
vscode "tomoki1207.pdf"
vscode "vmware.vscode-boot-dev-pack"
vscode "vmware.vscode-spring-boot"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscjava.vscode-spring-boot-dashboard"
vscode "vscjava.vscode-spring-initializr"
vscode "vstirbu.vscode-mermaid-preview"
vscode "yzane.markdown-pdf"
vscode "yzhang.markdown-all-in-one"
go "github.com/deepakjois/podscript"
cargo "broot"
cargo "hexyl"
cargo "zellij"
